LEXICON_EN = {
    "ru_pressed": "Вы выбрали русский язык. Спасибо, теперь введите ваше имя:",
    "get_name": "Спасибо, теперь введите номер отряда:",
    "get_group": (
        "Анкетирование завершено. Добро пожаловать в ваш личный кабинет."
    ),
    "methodist": "Вы получили права доступа методиста",
    "counselor": "Вы получили права доступа вожатого",
    # Отдельные фразы или слова
    "hello": "Привет",
    "lk_info": "Общая информация",
    "name": "Имя",
    "score": "Баллы",
    "group_number": "Номер отряда",
    "team_number": "Номер команды",
    # Заготовленный текст сообщений
    "hello_ask_name": (
        "Привет! Я бот Эдгам.\n"
        "Я помогу отслеживать накопленные тобой баллы и доступные "
        "достижения.\n"
        "<b>Представься пожалуйста:</b>"
    ),
    "hello_message": (
        "Ты можешь управлять мной с помощью кнопок, поэтому не будем медлить"
        " - выбирай нужный раздел!"
    ),
    "student_profile": (
        "На этой странице ты можешь изменить информацию о себе, обратиться "
        "к методисту или что-то еще."
    ),
    "error_getting_achievement": "Вернись к списку ачивок и выбери заново(=",
    "help_info": (
        "Итак, вижу, тебе нужна помощь=)\n"
        "Я могу помочь тебе в выполнении заданий, отслеживании твоих "
        "достижений и накопленных баллов, а также помогу связаться с твоим "
        "вожатым, если вдруг у тебя нет его контактов.\n\n"
        "Для управления мной используй кнопки внизу сообщений или боковое "
        "меню слева. Все команды содержат развернутые сообщения, поэтому "
        "просто читай, что я тебе пишу, и ты сможешь быстро научиться со "
        "мной работать!\n\n"
        "Для начала давай зайдем в твой личный кабинет! Жми кнопку ниже(="
    ),
    # Фразы в разделе ачивок
    "available_achievements": "Вот доступные тебе ачивки",
    "choose_achievement": "Выбери ачивку, которую хочешь выполнить",
    "achievement_chosen": "Итак, ты выбрал ачивку. Вот подробности",
    "send_artifact": (
        "Для выполнения этого задания просто отправь мне артефакты, приложив "
        "их к сообщению. Преподаватель проверит его и пришлет тебе ответ."
    ),
    "task_name": "Название",
    "score_rate": "Сколько баллов начислится",
    "task_description": "Что нужно сделать",
    "task_instruction": "Как нужно сделать",
    "artifact_type": "Что нужно прислать",
    "task_type": "Тип ачивки",
    "task_price": "Сколько баллов нужно для открытия ачивки",
    "artifact_sent": (
        "Артефакт отправлен, ты молодец! Хочешь сделать еще одну ачивку?"
    ),
    "pending_counselor": "На проверке у вожатого",
    "pending_methodist": "На проверке у преподавателя",
    "status_approved": "Принятно",
    "status_rejected": "Не принято",
    "rejection_reason": "Причина отказа",
    "no_achievement_completed": (
        "Кажется, ты еще не выполнил ни одной ачивки...\n\n" "Готов начать?=)"
    ),
    "no_achievement_reviewed": (
        "Кажется, твои ачивки еще не проверены... Но их обязательно "
        "проверят!\n\n"
        "А пока их проверяют, давай сделаем еще одну?=)"
    ),
    "achievements_completed": (
        "Ты молодец, делаешь много ачивок! Вот твои ачивки:"
    ),
    "cheer_up": "Продолжай в том же духе!",
    "reviewed_achievements": "Проверенные задания",
    "score_added": "Начислено баллов",
    "counselor_contact": (
        "Ок, вот реквизиты твоего вожатого. Нажми кнопку ниже, чтобы написать "
        "ему напрямую."
    ),
    "ask_artifact_again": "Нужно прислать правильный тип артефакта",
    # Фразы в разделе изменения профиля
    "edit_profile": "Что ты хочешь изменить?",
    "change_name": "Ок, пришли свое новое имя!",
    "name_changed": "Ок, теперь у тебя новое имя! Еще что-то надо изменить?",
    "change_language": "Ок, какой язык предпочитаешь?",
    "language_changed": (
        "Принято, будем с тобой общаться на русском! Что дальше?"
    ),
    "choose_edit_param": "Выбери раздел для изменения.",
    # Фразы в разделе присоединения к команде
    "show_teams_for_child": (
        "Так так, решил присоединиться к команде? Тогда поспеши, места "
        "скоро закончатся!\n"
        "Выбирай команду, и если там есть свободные места, смело вступай.\n\n"
        "А может ты даже захочешь стать капитаном команды? Для этого просто "
        "нажми нужную кнопку. Если у команды, конечно, еще нет капитана=)"
    ),
    "leave_team_instruction": (
        "Ты можешь уйти из команды и освободить место другим участникам.\n"
        "Если ты решишь выйти из команды, ты не сможешь выполнять командные "
        "ачивки, пока не добавишься в другую команду"
    ),
    "become_captain_instruction": (
        "В команде свободна позиция капитана! Ты можешь взять на себя эти "
        "обязанности. При выполнении командной ачивки именно капитан должен "
        "отправить артефакты на проверку, иначе никому из участников не "
        "начислятся баллы.\n\n"
        "Также нужно следить за уведомленями и выполнить ачивку заново со "
        "всей командой, если ачивку не примут с первого раза."
    ),
    "leave_captain_position": (
        "Ты - капитан команды! Так держать!\n"
        "Если ты захочешь освободить это место, нажми на нужную кнопку."
    ),
    "you_already_in_other_team": (
        "Ты уже участвуешь в другой команде. Если ты добавишься в эту, то "
        "автоматически удалишься из другой."
    ),
    "you_in_this_team": "Ты в этой команде!=)",
    "you_left_captain_position": "Ты освободил позицию капитана!",
    "you_left_team": "Ты ушел из команды!",
    "team_limit_reached_child": (
        "В команде нет свободных мест, выбери другую!=)"
    ),
    # Сообщения методиста
    "methodist_profile": (
        "Это твой личный кабинет. Здесь ты можешь управлять ачивками, "
        "проверять артефакты и тд.\n\n"
        "Выбирай нужный раздел!"
    ),
    "new_artifact": "Есть артефакты на проверку=)",
    "children_tasks": "Вот что уже выполнили твои ученики, проверь-ка",
    "checkout_artifacts": (
        "Чтобы посмотреть присланные артефакты, нажми кнопку с номером "
        "нужного задания"
    ),
    "sender": "Отправитель",
    "no_artifacts_yet": "Еще нет заданий на проверку=)",
    "no_tasks_yet": "Ачивки ещё не созданы... Давай создадим парочку?=)",
    # Сценарий добавления задания
    "add_task": (
        "Отлично! Чем больше заданий, тем веселее!\n\n"
        "Сейчас я поэтапно попрошу тебя прислать мне необходимую информацию "
        "для добавления ачивки в базу данных.\n\n"
        "Что мне потребуется:\n"
        "Название для ачивки (это название будут видеть дети)\n"
        "Описание ачивки\n"
        "Инструкция для ачивки (как нужно сделать)\n"
        "Сколько баллов начислится за выполнение\n"
        "Сколько баллов должно быть у ребенка для открытия ачивки\n"
        "Тип задания (индивидуальная или групповая)\n"
        "Тип артефактов (текст, фото, видео)\n"
        "И, конечно же, фото для ачивки!\n\n"
        "Готовы?=)"
    ),
    "send_task_name": "Ок! Как будет называться ачивка?",
    "send_task_description": "Отлично! Теперь пришли мне описание ачивки",
    "send_task_instruction": "Какие инструкции будут у ачивки?",
    "send_task_score": "Сколько баллов начислится за выполнение?",
    "send_task_price": "Сколько баллов нужно для открытия ачивки?",
    "ask_number_again": "Нужно прислать число цифрами без пробелов=)",
    "send_task_type": "Тип задания (индивидуальная или групповая)?",
    "send_task_artifact_type": "Тип артефактов (текст, фото, видео)?",
    "send_task_image": "И, конечно же, фото для ачивки!",
    "start_adding_over": (
        "Упс, кажется что-то пошло не по плану.. Начни создание задания "
        "заново=)"
    ),
    "ask_image_again": (
        "Нужно прислать изображение в сжатом виде, просто прикрепи его к "
        "сообщению, отметь 'Сжать изображение' и отправь=)"
    ),
    "confirm_adding_task": (
        "Вау! Ачивка почти готова! Проверь, на всякий, что все верно. "
        "Если что-то надо исправить, исправляй, если все ок, то подтверждай!=)"
    ),
    "task_added": (
        "Супер! Ачивка добавлена, дети точно не заскучают!\n\n"
        "Добавим еще одну ачивку?=)"
    ),
    "error_adding_task": (
        "Упс! Что-то пошло, не так=( Кажется, пока не получится сохранить "
        "ачивку.\n\n"
        "Можно пока что сделать что-нибудь другое, например, посмотреть "
        "артефакты на проверку=)"
    ),
    "individual": "Индивидуальная",
    "teamwork": "Групповая",
    "text": "Текст",
    "image": "Фото",
    "video": "Видео",
    "audio": "Аудио",
    "voice": "Голосовое сообщение",
    # Сценарий редактирования задания
    "start_edit_task": "Ок! Что ты хочешь изменить?",
    "error_task_already_saved": (
        "Кажется, ты уже все сохранил.. Ты можешь изменить задания нажав на "
        "кнопку на клавиатуре:"
    ),
    "edit_task_name": "Ок! Пришли мне новое название ачивки!",
    "edit_task_description": "Отлично! Пришли мне новое описание ачивки",
    "edit_task_instruction": "Какие инструкции будут у ачивки?",
    "edit_task_score": "Ок, сколько баллов начислится?",
    "edit_task_price": "Сколько баллов нужно для открытия ачивки?",
    "edit_task_type": "Ок, выбери тип задания!",
    "edit_task_artifact_type": "Тип артефактов?",
    "edit_task_image": "Ок, пришли мне новое фото для ачивки!",
    "task_edited": (
        "Готово! Что еще нужно изменить? Если все в порядке, нажимай "
        "'Завершить'"
    ),
    "achievement_list": (
        "Вот список всех имеющихся в базе ачивок. Ты можешь выбрать ачивку "
        "для просмотра полной информации и редактирования, нажав на кнопку с "
        "номером ачивки."
    ),
    "editing_completed": "Закончили редактировать! Выбирай подходящий раздел!",
    # Проверка задания
    "review_name": "Название:",
    "review_description": "Описание:",
    "review_instruction": "Инструкция:",
    "review_type": "Тип задания (индивидуальное или групповое):",
    "review_artifact": "Тип артефактов (текст, фото или видео):",
    "review_user": "Отправитель:",
    # Создание команды
    "create_team_instruction": (
        "Команда - это хорошо!\n"
        "У команды есть название, размер и участиники. Название и размер "
        "команды нужно указать сразу, а участников можно добавить сразу или "
        "оставить места незаполненными. Так участники смогут добавляться в "
        "команду самостоятельно.\n\n"
        "Начнем создание команды??"
    ),
    "send_team_name": "Итак, напиши, как будет называться команда?",
    "send_team_size": (
        "Отлично! Теперь выбери, сколько человек должно быть в команде?"
    ),
    "add_team_member": (
        "Почти готово!\n\n"
        "Хочешь добавить участников сразу, или пусть сами добавляются?"
    ),
    "choose_team_member": (
        "Ок, вот список детей, выбирай, кто нравится!\n\n"
        "Количество детей не должно быть больше размера команды."
    ),
    "confirm_creating_team": (
        "Супер! Команда почти готова! Проверь, все ли верно?"
    ),
    "complete_creating_team": "Поздравляю, команда создана! Создать ещё одну?",
    "cancel_create_team": (
        "Ок! Можно создать команду и позже.\n\n" "Чем займешься сейчас?=)"
    ),
    "pass_adding_members": (
        "Ок! Можно добавить участников позже в разделе редактирования команд. "
        "А ещё, участники могут сами выбрать себе команды!"
    ),
    "add_this_user": "Добавить этого ребенка в команду?",
    "member_added": "Ребенок добавлен в команду!=)",
    "member_deleted": "Ребенок удален из команды!=)",
    "user_already_in_other_team": (
        "Этот ребенок уже участвует в другой команде. "
        "Если ты добавишь его в эту, он удалится из другой команды."
    ),
    "show_teams_list": (
        "Вот список созданных команд. Можно выбрать команду, "
        "чтобы добавить участников или изменить характеристики команды."
    ),
    "no_teams_yet": "Команды еще не созданы=)",
    "team_size": "Размер команды",
    "team_members": "Участники",
    "team_name": "Название",
    "team_limit_reached": (
        "В команде больше нет мест! Если хочешь добавить этого участника, "
        "нужно удалить кого-нибудь другого=)"
    ),
    "start_edit_team": "Ок! Что ты хочешь изменить?",
    "edit_team_name": "Хорошо, пришли мне новое название команды!",
    "team_edited": (
        "Готово! Что ещё нужно изменить? Если все в порядке, нажимай "
        "'Завершить'=)"
    ),
    "edit_team_size": "Итак, выбирай, какого размера будет команда?",
    # Фразы для админки
    "henchman_pass": "Выберите какой пароль хотите поменять:",
    "counselor_pass": "Введите новый пароль для вожатого:",
    "methodist_pass": "Введите новый пароль для методиста:",
    "master_pass": "Введите новый мастер-пароль:",
}

BUTTONS_EN = {
    # Описания команд в главном меню
    "start_description": "Начало работы бота",
    "help": "Справка по работе бота",
    "lk": "Личный кабинет",
    "available_achievements": "Доступные задания",
    "current_achievements": "Текущие задания",
    "reviewed_achievements": "Проверенные задания",
    "write_to_methodist": "Написать преподавателю",
    "write_to_counselor": "Написать вожатому",
    "join_team": "Присоединиться к команде",
    "leave_team": "Уйти из команды",
    "become_captain": "Стать капитаном",
    "leave_captain_position": "Уйти с поста капитана",
    # Редактирование профиля
    "edit_profile": "Редактировать профиль",
    "change_firstname": "Имя",
    "change_language": "Язык бота",
    "main_menu": "Главное меню",
    "counselor_chat": "Написать вожатому",
    # Личный кабинет методиста
    "add_task": "Добавить задание",
    "edit_task": "Редактировать задание",
    "tasks_for_review": "Проверить задания",
    "no_tasks_yet": "Задания еще не созданы=)",
    "approve": "Принять",
    "reject": "Отклонить",
    "ready": "Погнали!",
    "cancel": "Отменить",
    "task_approved": "Задание принято! ID:",
    "failed_to_find_task": "Не удалось найти задание с ID",
    "task_rejected": "Задание отклонено! Хотите указать причину отказа?",
    "give_rejection_reason": (
        "Введите причину отказа следующим сообщением. Если передумаете - "
        "введите 'Отмена'"
    ),
    "rejection_reason_saved": "Причина отказа сохранена",
    "no_rejection_reason": (
        "Хорошо! Сообщение об отмене будет доставлено без комментария"
    ),
    "confirm_adding_task": "Подтверждаю!",
    "edit_name": "Название",
    "edit_image": "Изображение",
    "edit_description": "Описание",
    "edit_instruction": "Инструкцию",
    "edit_task_type": "Тип ачивки",
    "edit_artifact_type": "Тип артефакта",
    "edit_score": "Кол-во баллов",
    "edit_price": "Стоимость ачивки",
    "start_over": "Начать заново",
    "achievement_list": "Посмотреть/Редактировать ачивки",
    "complete_editing_task": "Завершить!",
    "create_team": "Создать команду",
    "add_team_members": "Добавить участников",
    "pass": "Пропустить",
    "add": "Добавить",
    "back": "<< Назад",
    "delete_from_team": "Удалить из команды",
    "team_list": "Посмотреть/Редактировать команды",
    "edit_team": "Изменить команду",
    "complete_creating_team": "Завершить!",
    "edit_team_members": "Изменить состав команд",
    "team_size": "Размер команды",
    "team_name": "Название команды",
}
