LEXICON = {
    'RU': {
        'ru_pressed': 'Вы выбрали русский язык',
        'methodist': 'Вы получили права доступа методиста',
        'councelor': 'Вы получили права доступа вожатого',
        # Отдельные фразы или слова
        'hello': 'Привет',
        'lk_info': 'Общая информация',
        'name': 'имя',
        'score': 'баллы',
        # Заготовленный текст сообщений
        'hello_ask_name': 'Привет! Я бот Эдгам.\n'
                          'Я помогу отслеживать накопленные тобой баллы и доступные достижения.\n'
                          '<b>Представься пожалуйста:</b>',
        'hello_message': 'Ты можешь управлять мной с помощью кнопок, '
                         'поэтому не будем медлить - выбирай нужный раздел!',
        'task_instruction': 'Для выполнения этого задания просто отправь мне артефакты, приложив '
                            'их к сообщению. Преподаватель проверит его и пришлет тебе ответ.',
        'student_profile': 'На этой странице ты можешь изменить информацию о себе, '
                           'обратиться к методисту или что-то еще.',
        # Фразы в разделе изменения профиля
        'edit_profile': 'Что ты хочешь изменить?',
        'change_name': 'Ок, пришли свое новое имя!',
        'name_changed': 'Ок, теперь у тебя новое имя! Еще что-то надо изменить?',
        'change_language': 'Ок, какой язык предпочитаешь?',
        'language_changed': 'Принято, будем с тобой общаться на русском! Что дальше?',
        'choose_edit_param': 'Выбери раздел для изменения.'
    },

    'TT': {
        'tt_pressed': 'Сез татар телен сайладыгыз',
        'methodist': 'Сез методистка керү хокукын алдыгызмы',
        'councelor': 'Сез башлыкның керү хокукын алдыгызмы',
        # Отдельные фразы или слова
        'hello': 'Привет',
        'lk_info': 'Общая информация',
        'name': 'имя',
        'score': 'баллы',
        # Заготовленный текст сообщений
        'hello_ask_name': 'Привет! Я бот Эдгам.\n'
                          'Я помогу отслеживать накопленные тобой баллы и доступные достижения.\n'
                          '<b>Представься пожалуйста:</b>',
        'hello_message': 'Ты можешь управлять мной с помощью кнопок, '
                         'поэтому не будем медлить - выбирай нужный раздел!',
        'task_instruction': 'Для выполнения этого задания просто отправь мне артефакты, приложив '
                            'их к сообщению. Преподаватель проверит его и пришлет тебе ответ.',
        'student_profile': 'На этой странице ты можешь изменить информацию о себе, '
                           'обратиться к методисту или что-то еще.',
        # Фразы в разделе изменения профиля
        'edit_profile': 'Что ты хочешь изменить?',
        'change_name': 'Ок, пришли свое новое имя!',
        'name_changed': 'Ок, теперь у тебя новое имя! Еще что-то надо изменить?',
        'change_language': 'Ок, какой язык предпочитаешь?',
        'language_changed': 'Принято, будем с тобой общаться на татарском! Что дальше?'
    },

    'EN': {
        'en_pressed': 'You have chosen English',
        'methodist': 'You have received the access rights of a methodologist',
        'councelor': 'You have received the access rights of a counselor',
        # Отдельные фразы или слова
        'hello': 'Hi',
        'lk_info': 'General information',
        'name': 'name',
        'score': 'score',
        # Заготовленный текст сообщений
        'hello_ask_name': 'Привет! Я бот Эдгам.\n'
                          'Я помогу отслеживать накопленные тобой баллы и доступные достижения.\n'
                          '<b>Представься пожалуйста:</b>',
        'hello_message': 'Ты можешь управлять мной с помощью кнопок, '
                         'поэтому не будем медлить - выбирай нужный раздел!',
        'task_instruction': 'Для выполнения этого задания просто отправь мне артефакты, приложив '
                            'их к сообщению. Преподаватель проверит его и пришлет тебе ответ.',
        'student_profile': 'На этой странице ты можешь изменить информацию о себе, '
                           'обратиться к методисту или что-то еще.',
        # Фразы в разделе изменения профиля
        'edit_profile': 'Что ты хочешь изменить?',
        'change_name': 'Ок, пришли свое новое имя!',
        'name_changed': 'Ок, теперь у тебя новое имя! Еще что-то надо изменить?',
        'change_language': 'Ок, какой язык предпочитаешь?',
        'language_changed': 'Done, let`s talk English! What`s next?'
    }
}

LEXICON_COMMANDS = {
    '/start': 'Выберите язык / Select a language'
}
