LEXICON_RU = {
    '/start': 'Привет! Я бот Эдгам.\n'
              'Я помогу отслеживать накопленные тобой баллы и доступные достижения.\n'
              '<b>Представься пожалуйста:</b>',
    'hello_message': 'Ты можешь управлять мной с помощью кнопок, '
                     'поэтому не будем медлить - выбирай нужный раздел!',
    'task_instruction': 'Для выполнения этого задания просто отправь мне артефакты, приложив '
                        'их к сообщению. Преподаватель проверит его и пришлет тебе ответ.',
    'student_menu': 'Имя: Юзер\n\nБаллы: 100\n\nНомер отряда: 10',
    'student_profile': 'На этой странице ты можешь изменить информацию о себе, '
                       'обратиться к методисту или что-то еще.',
    'edit_profile': 'Что ты хочешь изменить?'
}

LEXICON_TATAR = {}

LEXICON_EN = {}
