LEXICON = {
    'RU': {
        'ru_pressed': 'Вы выбрали русский язык',
        'methodist': 'Вы получили права доступа методиста',
        'councelor': 'Вы получили права доступа вожатого',
        # Отдельные фразы или слова
        'hello': 'Привет',
        'lk_info': 'Общая информация',
        'name': 'Имя',
        'score': 'Баллы',
        # Заготовленный текст сообщений
        'hello_ask_name': 'Привет! Я бот Эдгам.\n'
                          'Я помогу отслеживать накопленные тобой баллы и доступные достижения.\n'
                          '<b>Представься пожалуйста:</b>',
        'hello_message': 'Ты можешь управлять мной с помощью кнопок, '
                         'поэтому не будем медлить - выбирай нужный раздел!',
        'student_profile': 'На этой странице ты можешь изменить информацию о себе, '
                           'обратиться к методисту или что-то еще.',
        'error_getting_achievement': 'Вернись к списку ачивок и выбери заново(=',
        'help_info': 'Итак, вижу, тебе нужна помощь=)\n'
                     'Я могу помочь тебе в выполнении заданий, отслеживании твоих '
                     'достижений и накопленных баллов, а также помогу связаться с твоим вожатым, '
                     'если вдруг у тебя нет его контактов.\n\n'
                     'Для управления мной используй кнопки внизу сообщений или боковое меню слева.'
                     'Все команды содержат развернутые сообщения, поэтому просто читай, что я тебе пишу, '
                     'и ты сможешь быстро научиться со мной работать!\n\n'
                     'Для начала давай зайдем в твой личный кабинет! Жми кнопку ниже(=',
        # Фразы в разделе ачивок
        'available_achievements': 'Вот доступные тебе ачивки',
        'choose_achievement': 'Выбери ачивку, которую хочешь выполнить',
        'achievement_chosen': 'Итак, ты выбрал ачивку. Вот подробности',
        'send_artifact': 'Для выполнения этого задания просто отправь мне артефакты, приложив '
                     'их к сообщению. Преподаватель проверит его и пришлет тебе ответ.',
        'task_name': 'Название',
        'score_rate': 'Сколько баллов начислится',
        'task_description': 'Что нужно сделать',
        'task_instruction': 'Как нужно сделать',
        'artifact_type': 'Что нужно прислать',
        'task_type': 'Тип ачивки',
        'task_price': 'Сколько баллов нужно для открытия ачивки',
        'artifact_sent': 'Артефакт отправлен, ты молодец! Хочешь сделать еще одну ачивку?',
        'pending_councelor': 'На проверке у вожатого',
        'pending_methodist': 'На проверке у преподавателя',
        'status_approved': 'Принятно',
        'status_rejected': 'Не принято',
        'rejection_reason': 'Причина отказа',
        'no_achievement_completed': 'Кажется, ты еще не выполнил ни одной ачивки...\n\n'
                                    'Готов начать?=)',
        'no_achievement_reviewed': 'Кажется, твои ачивки еще не проверены... Но их обязательно проверят!\n\n'
                                   'А пока их проверяют, давай сделаем еще одну?=)',
        'achievements_completed': 'Ты молодец, делаешь много ачивок! Вот твои ачивки:',
        'cheer_up': 'Продолжай в том же духе!',
        'reviewed_achievements': 'Проверенные задания',
        'score_added': 'Начислено баллов',
        'councelor_contact': 'Ок, вот реквизиты твоего вожатого. '
                             'Нажми кнопку ниже, чтобы написать ему напрямую.',
        # Фразы в разделе изменения профиля
        'edit_profile': 'Что ты хочешь изменить?',
        'change_name': 'Ок, пришли свое новое имя!',
        'name_changed': 'Ок, теперь у тебя новое имя! Еще что-то надо изменить?',
        'change_language': 'Ок, какой язык предпочитаешь?',
        'language_changed': 'Принято, будем с тобой общаться на русском! Что дальше?',
        'choose_edit_param': 'Выбери раздел для изменения.',
        # Сообщения методиста
        'new_artifact': 'Есть артефакты на проверку=)',
        'children_tasks': 'Вот что уже выполнили твои ученики, проверь-ка',
        'checkout_artifacts': 'Чтобы посмотреть присланные артефакты, нажми кнопку с номером нужного задания',
        'sender': 'Отправитель',
        'no_artifacts_yet': 'Еще нет заданий на проверку=)'
    },

    'TT': {
        'tt_pressed': 'Сез татар телен сайладыгыз',
        'methodist': 'Сез методистка керү хокукын алдыгызмы',
        'councelor': 'Сез башлыкның керү хокукын алдыгызмы',
        # Отдельные фразы или слова
        'hello': 'Привет',
        'lk_info': 'Общая информация',
        'name': 'имя',
        'score': 'баллы',
        # Заготовленный текст сообщений
        'hello_ask_name': 'Привет! Я бот Эдгам.\n'
                          'Я помогу отслеживать накопленные тобой баллы и доступные достижения.\n'
                          '<b>Представься пожалуйста:</b>',
        'hello_message': 'Ты можешь управлять мной с помощью кнопок, '
                         'поэтому не будем медлить - выбирай нужный раздел!',
        'student_profile': 'На этой странице ты можешь изменить информацию о себе, '
                           'обратиться к методисту или что-то еще.',
        'error_getting_achievement': 'Вернись к списку ачивок и выбери заново(=',
        'help_info': 'Итак, вижу, тебе нужна помощь=)\n'
                     'Я могу помочь тебе в выполнении заданий, отслеживании твоих '
                     'достижений и накопленных баллов, а также помогу связаться с твоим вожатым, '
                     'если вдруг у тебя нет его контактов.\n\n'
                     'Для управления мной используй кнопки внизу сообщений или боковое меню слева.'
                     'Все команды содержат развернутые сообщения, поэтому просто читай, что я тебе пишу, '
                     'и ты сможешь быстро научиться со мной работать!\n\n'
                     'Для начала давай зайдем в твой личный кабинет! Жми кнопку ниже(=',
        # Фразы в разделе ачивок
        'available_achievements': 'Вот доступные тебе ачивки',
        'choose_achievement': 'Выбери ачивку, которую хочешь выполнить',
        'achievement_chosen': 'Итак, ты выбрал ачивку. Вот подробности',
        'send_artifact': 'Для выполнения этого задания просто отправь мне артефакты, приложив '
                         'их к сообщению. Преподаватель проверит его и пришлет тебе ответ.',
        'task_name': 'Название',
        'score_rate': 'Сколько баллов начислится',
        'task_description': 'Что нужно сделать',
        'task_instruction': 'Как нужно сделать',
        'artifact_type': 'Что нужно прислать',
        'task_type': 'Тип ачивки',
        'task_price': 'Сколько баллов нужно для открытия ачивки',
        'artifact_sent': 'Артефакт отправлен, ты молодец! Хочешь сделать еще одну ачивку?',
        'pending_councelor': 'на проверке у вожатого',
        'pending_methodist': 'на проверке у преподавателя',
        'status_approved': 'принятно',
        'status_rejected': 'не принято',
        'rejection_reason': 'Причина отказа',
        'no_achievement_completed': 'Кажется, ты еще не выполнил ни одной ачивки...\n\n'
                                    'Готов начать?=)',
        'no_achievement_reviewed': 'Кажется, твои ачивки еще не проверены... Но их обязательно проверят!\n\n'
                                   'А пока их проверяют, давай сделаем еще одну?=)',
        'achievements_completed': 'Ты молодец, делаешь много ачивок! Вот твои ачивки:',
        'reviewed_achievements': 'Reviewed achievements',
        'cheer_up': 'Продолжай в том же духе!',
        'score_added': 'Начислено баллов',
        'councelor_contact': 'Ок, вот реквизиты твоего вожатого. '
                             'Нажми кнопку ниже, чтобы написать ему напрямую.',
        # Фразы в разделе изменения профиля
        'edit_profile': 'Что ты хочешь изменить?',
        'change_name': 'Ок, пришли свое новое имя!',
        'name_changed': 'Ок, теперь у тебя новое имя! Еще что-то надо изменить?',
        'change_language': 'Ок, какой язык предпочитаешь?',
        'language_changed': 'Принято, будем с тобой общаться на татарском! Что дальше?',
        # Сообщения методиста
        'new_artifact': 'Есть артефакты на проверку=)',
        'children_tasks': 'Вот что уже выполнили твои ученики, проверь-ка',
        'checkout_artifacts': 'Чтобы посмотреть присланные артефакты, нажми кнопку с номером нужного задания',
        'sender': 'Отправитель',
        'no_artifacts_yet': 'Еще нет заданий на проверку=)'
    },

    'EN': {
        'en_pressed': 'You have chosen English',
        'methodist': 'You have received the access rights of a methodologist',
        'councelor': 'You have received the access rights of a counselor',
        # Отдельные фразы или слова
        'hello': 'Hi',
        'lk_info': 'General information',
        'name': 'name',
        'score': 'score',
        # Заготовленный текст сообщений
        'hello_ask_name': 'Привет! Я бот Эдгам.\n'
                          'Я помогу отслеживать накопленные тобой баллы и доступные достижения.\n'
                          '<b>Представься пожалуйста:</b>',
        'hello_message': 'Ты можешь управлять мной с помощью кнопок, '
                         'поэтому не будем медлить - выбирай нужный раздел!',
        'student_profile': 'На этой странице ты можешь изменить информацию о себе, '
                           'обратиться к методисту или что-то еще.',
        'error_getting_achievement': 'Вернись к списку ачивок и выбери заново(=',
        'help_info': 'Итак, вижу, тебе нужна помощь=)\n'
                     'Я могу помочь тебе в выполнении заданий, отслеживании твоих '
                     'достижений и накопленных баллов, а также помогу связаться с твоим вожатым, '
                     'если вдруг у тебя нет его контактов.\n\n'
                     'Для управления мной используй кнопки внизу сообщений или боковое меню слева.'
                     'Все команды содержат развернутые сообщения, поэтому просто читай, что я тебе пишу, '
                     'и ты сможешь быстро научиться со мной работать!\n\n'
                     'Для начала давай зайдем в твой личный кабинет! Жми кнопку ниже(=',
        # Фразы в разделе ачивок
        'available_achievements': 'Вот доступные тебе ачивки',
        'choose_achievement': 'Выбери ачивку, которую хочешь выполнить',
        'achievement_chosen': 'Итак, ты выбрал ачивку. Вот подробности',
        'send_artifact': 'Для выполнения этого задания просто отправь мне артефакты, приложив '
                         'их к сообщению. Преподаватель проверит его и пришлет тебе ответ.',
        'task_name': 'Название',
        'score_rate': 'Сколько баллов начислится',
        'task_description': 'Что нужно сделать',
        'task_instruction': 'Как нужно сделать',
        'artifact_type': 'Что нужно прислать',
        'task_type': 'Тип ачивки',
        'task_price': 'Сколько баллов нужно для открытия ачивки',
        'artifact_sent': 'Артефакт отправлен, ты молодец! Хочешь сделать еще одну ачивку?',
        'pending_councelor': 'Councelor reviewing',
        'pending_methodist': 'Methodist reviewing',
        'status_approved': 'Approved',
        'status_rejected': 'Rejected',
        'rejection_reason': 'Причина отказа',
        'no_achievement_completed': 'Кажется, ты еще не выполнил ни одной ачивки...\n\n'
                                    'Готов начать?=)',
        'no_achievement_reviewed': 'Кажется, твои ачивки еще не проверены... Но их обязательно проверят!\n\n'
                                   'А пока их проверяют, давай сделаем еще одну?=)',
        'achievements_completed': 'Ты молодец, делаешь много ачивок! Вот твои ачивки:',
        'cheer_up': 'Продолжай в том же духе!',
        'reviewed_achievements': 'Reviewed achievements',
        'score_added': 'Начислено баллов',
        'councelor_contact': 'Ок, вот реквизиты твоего вожатого. '
                             'Нажми кнопку ниже, чтобы написать ему напрямую.',
        # Фразы в разделе изменения профиля
        'edit_profile': 'Что ты хочешь изменить?',
        'change_name': 'Ок, пришли свое новое имя!',
        'name_changed': 'Ок, теперь у тебя новое имя! Еще что-то надо изменить?',
        'change_language': 'Ок, какой язык предпочитаешь?',
        'language_changed': 'Done, let`s talk English! What`s next?',
        # Сообщения методиста
        'new_artifact': 'Есть артефакты на проверку=)',
        'children_tasks': 'Вот что уже выполнили твои ученики, проверь-ка',
        'checkout_artifacts': 'Чтобы посмотреть присланные артефакты, нажми кнопку с номером нужного задания',
        'sender': 'Отправитель',
        'no_artifacts_yet': 'Еще нет заданий на проверку=)'
    }
}

LEXICON_COMMANDS = {
    '/start': 'Выберите язык / Select a language'
}

BUTTONS = {
    'RU': {
        # Описания команд в главном меню
        'start_description': 'Начало работы бота',
        'help': 'Справка по работе бота',
        'lk': 'Личный кабинет',
        'available_achievements': 'Доступные задания',
        'current_achievements': 'Текущие задания',
        'reviewed_achievements': 'Проверенные задания',
        'write_to_methodist': 'Написать преподавателю',
        'write_to_councelor': 'Написать вожатому',
        # Редактирование профиля
        'edit_profile': 'Редактировать профиль',
        'change_firstname': 'Имя',
        'change_language': 'Язык бота',
        'main_menu': 'Главное меню',
        'councelor_chat': 'Написать вожатому',
        # Личный кабинет методиста
        'add_task': 'Добавить задание',
        'edit_task': 'Редактировать задание',
        'tasks_for_review': 'Задания на проверку',
        'approve': 'Принять',
        'reject': 'Отклонить'
    },
    'TT': {
        'start_description': 'Начало работы бота',
        'help': 'Справка по работе бота',
        'lk': 'Личный кабинет',
        'available_achievements': 'Доступные задания',
        'current_achievements': 'Текущие задания',
        'reviewed_achievements': 'Проверенные задания',
        'write_to_methodist': 'Написать преподавателю',
        'write_to_councelor': 'Написать вожатому',
        # Редактирование профиля
        'edit_profile': 'Редактировать профиль',
        'change_firstname': 'Имя',
        'change_language': 'Язык бота',
        'main_menu': 'Главное меню',
        'councelor_chat': 'Написать вожатому',
        # Личный кабинет методиста
        'add_task': 'Добавить задание',
        'edit_task': 'Редактировать задание',
        'tasks_for_review': 'Задания на проверку',
        'approve': 'Принять',
        'reject': 'Отклонить'
    },
    'EN': {
        'start_description': 'Начало работы бота',
        'help': 'Instructions on how to use the bot',
        'lk': 'Profile',
        'available_achievements': 'Available achievements',
        'current_achievements': 'Current achievements',
        'reviewed_achievements': 'Reviewed achievements',
        'write_to_methodist': 'Write to methodist',
        'write_to_councelor': 'Написать вожатому',
        # Редактирование профиля
        'edit_profile': 'Edit profile',
        'change_firstname': 'Name',
        'change_language': 'Bot`s language',
        'main_menu': 'Main menu',
        'councelor_chat': 'Написать вожатому',
        # Личный кабинет методиста
        'add_task': 'Добавить задание',
        'edit_task': 'Редактировать задание',
        'tasks_for_review': 'Задания на проверку',
        'approve': 'Принять',
        'reject': 'Отклонить'
    }
}
